{"class_name": "Model", "config": {"layers": [{"name": "input_1", "inbound_nodes": [], "config": {"name": "input_1", "batch_input_shape": [null, 30, 101], "sparse": false, "dtype": "float32"}, "class_name": "InputLayer"}, {"name": "input_2", "inbound_nodes": [], "config": {"name": "input_2", "batch_input_shape": [null, 30, 101], "sparse": false, "dtype": "float32"}, "class_name": "InputLayer"}, {"name": "bidirectional_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"name": "bidirectional_1", "merge_mode": "concat", "layer": {"class_name": "LSTM", "config": {"recurrent_regularizer": null, "recurrent_constraint": null, "recurrent_dropout": 0.15, "use_bias": true, "units": 101, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unit_forget_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "trainable": true, "return_sequences": true, "kernel_constraint": null, "name": "A1_layer1", "activity_regularizer": null, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "dropout": 0.15, "stateful": false, "unroll": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "implementation": 0, "bias_constraint": null}}, "trainable": true}, "class_name": "Bidirectional"}, {"name": "bidirectional_2", "inbound_nodes": [[["input_2", 0, 0, {}]]], "config": {"name": "bidirectional_2", "merge_mode": "concat", "layer": {"class_name": "LSTM", "config": {"recurrent_regularizer": null, "recurrent_constraint": null, "recurrent_dropout": 0.15, "use_bias": true, "units": 101, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unit_forget_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "trainable": true, "return_sequences": true, "kernel_constraint": null, "name": "B_layer1", "activity_regularizer": null, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "dropout": 0.15, "stateful": false, "unroll": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "implementation": 0, "bias_constraint": null}}, "trainable": true}, "class_name": "Bidirectional"}, {"name": "A1_layer2", "inbound_nodes": [[["bidirectional_1", 0, 0, {}]]], "config": {"recurrent_regularizer": null, "recurrent_constraint": null, "recurrent_dropout": 0.15, "use_bias": true, "units": 202, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unit_forget_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "trainable": true, "return_sequences": true, "kernel_constraint": null, "name": "A1_layer2", "activity_regularizer": null, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "dropout": 0.15, "stateful": false, "unroll": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "implementation": 0, "bias_constraint": null}, "class_name": "LSTM"}, {"name": "B_layer2", "inbound_nodes": [[["bidirectional_2", 0, 0, {}]]], "config": {"recurrent_regularizer": null, "recurrent_constraint": null, "recurrent_dropout": 0.15, "use_bias": true, "units": 202, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unit_forget_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "trainable": true, "return_sequences": true, "kernel_constraint": null, "name": "B_layer2", "activity_regularizer": null, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "dropout": 0.15, "stateful": false, "unroll": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "implementation": 0, "bias_constraint": null}, "class_name": "LSTM"}, {"name": "concatenate_1", "inbound_nodes": [[["A1_layer2", 0, 0, {}], ["B_layer2", 0, 0, {}]]], "config": {"axis": -1, "name": "concatenate_1", "trainable": true}, "class_name": "Concatenate"}, {"name": "A2_layer1", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "config": {"recurrent_regularizer": null, "recurrent_constraint": null, "recurrent_dropout": 0.15, "use_bias": true, "units": 404, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unit_forget_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "trainable": true, "return_sequences": true, "kernel_constraint": null, "name": "A2_layer1", "activity_regularizer": null, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "dropout": 0.15, "stateful": false, "unroll": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "implementation": 0, "bias_constraint": null}, "class_name": "LSTM"}, {"name": "time_distributed_1", "inbound_nodes": [[["A2_layer1", 0, 0, {}]]], "config": {"name": "time_distributed_1", "layer": {"class_name": "Dense", "config": {"name": "A2_layer2", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "units": 10003, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "activation": "softmax", "kernel_regularizer": null, "trainable": true, "bias_constraint": null}}, "trainable": true}, "class_name": "TimeDistributed"}], "name": "model_1", "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "output_layers": [["time_distributed_1", 0, 0]]}, "backend": "tensorflow", "keras_version": "2.0.3"}