{"config": {"output_layers": [["time_distributed_1", 0, 0]], "layers": [{"config": {"sparse": false, "batch_input_shape": [null, 30, 101], "name": "input_1", "dtype": "float32"}, "class_name": "InputLayer", "name": "input_1", "inbound_nodes": []}, {"config": {"sparse": false, "batch_input_shape": [null, 30, 101], "name": "input_2", "dtype": "float32"}, "class_name": "InputLayer", "name": "input_2", "inbound_nodes": []}, {"config": {"trainable": true, "layer": {"config": {"stateful": false, "bias_regularizer": null, "activation": "tanh", "dropout": 0.15, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "return_sequences": true, "unit_forget_bias": true, "recurrent_constraint": null, "recurrent_dropout": 0.15, "unroll": false, "recurrent_regularizer": null, "bias_constraint": null, "go_backwards": false, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "implementation": 0, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "units": 101, "trainable": true, "use_bias": true, "name": "A1_layer1", "recurrent_activation": "hard_sigmoid"}, "class_name": "LSTM"}, "name": "bidirectional_1", "merge_mode": "concat"}, "class_name": "Bidirectional", "name": "bidirectional_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"trainable": true, "layer": {"config": {"stateful": false, "bias_regularizer": null, "activation": "tanh", "dropout": 0.15, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "return_sequences": true, "unit_forget_bias": true, "recurrent_constraint": null, "recurrent_dropout": 0.15, "unroll": false, "recurrent_regularizer": null, "bias_constraint": null, "go_backwards": false, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "implementation": 0, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "units": 101, "trainable": true, "use_bias": true, "name": "B_layer1", "recurrent_activation": "hard_sigmoid"}, "class_name": "LSTM"}, "name": "bidirectional_2", "merge_mode": "concat"}, "class_name": "Bidirectional", "name": "bidirectional_2", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"config": {"stateful": false, "bias_regularizer": null, "activation": "tanh", "dropout": 0.15, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "return_sequences": true, "unit_forget_bias": true, "recurrent_constraint": null, "recurrent_dropout": 0.15, "unroll": false, "recurrent_regularizer": null, "bias_constraint": null, "go_backwards": false, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "implementation": 0, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "units": 202, "trainable": true, "use_bias": true, "name": "A1_layer2", "recurrent_activation": "hard_sigmoid"}, "class_name": "LSTM", "name": "A1_layer2", "inbound_nodes": [[["bidirectional_1", 0, 0, {}]]]}, {"config": {"stateful": false, "bias_regularizer": null, "activation": "tanh", "dropout": 0.15, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "return_sequences": true, "unit_forget_bias": true, "recurrent_constraint": null, "recurrent_dropout": 0.15, "unroll": false, "recurrent_regularizer": null, "bias_constraint": null, "go_backwards": false, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "implementation": 0, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "units": 202, "trainable": true, "use_bias": true, "name": "B_layer2", "recurrent_activation": "hard_sigmoid"}, "class_name": "LSTM", "name": "B_layer2", "inbound_nodes": [[["bidirectional_2", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "concatenate_1", "axis": -1}, "class_name": "Concatenate", "name": "concatenate_1", "inbound_nodes": [[["A1_layer2", 0, 0, {}], ["B_layer2", 0, 0, {}]]]}, {"config": {"stateful": false, "bias_regularizer": null, "activation": "tanh", "dropout": 0.15, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "return_sequences": true, "unit_forget_bias": true, "recurrent_constraint": null, "recurrent_dropout": 0.15, "unroll": false, "recurrent_regularizer": null, "bias_constraint": null, "go_backwards": false, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "implementation": 0, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "units": 404, "trainable": true, "use_bias": true, "name": "A2_layer1", "recurrent_activation": "hard_sigmoid"}, "class_name": "LSTM", "name": "A2_layer1", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"config": {"trainable": true, "layer": {"config": {"bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "softmax", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "units": 10003, "trainable": true, "name": "A2_layer2", "use_bias": true}, "class_name": "Dense"}, "name": "time_distributed_1"}, "class_name": "TimeDistributed", "name": "time_distributed_1", "inbound_nodes": [[["A2_layer1", 0, 0, {}]]]}], "name": "model_1", "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]]}, "backend": "tensorflow", "class_name": "Model", "keras_version": "2.0.3"}